Revit 2027 API
ParameterTypeId.IfcExportElementTypeAs Property
 "Export Type to IFC As"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcExportElementTypeAs { get; }
Public Shared ReadOnly Property IfcExportElementTypeAs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcExportElementTypeAs {
	ForgeTypeId^ get ();
}
static member IfcExportElementTypeAs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace